# Review of Database and SQL

- [Database connection methonds for SQLite and PostgresDB](#connecting)
    - [Connecting to a Local Database from Terminal](#connecting-to-localdb)
    - [Connecting to a Remote Database from Terminal](#remote-database)
    - [Comparison of DB Commands](#comparison-commands)
- [Python connection](#python-sqlite)
- [SQL Reference](#sql-reference)

- [Database Search and Retrieval Commands](#SQL-command-order)
- [SQL Sub-queries: Discussion, examples and links to information](#SQL-sub-queries) 


Useful Links:

https://en.wikipedia.org/wiki/SQL_syntax

http://www.studytonight.com/dbms/introduction-to-sql.php  breaks commands into useful categories

<a name="connecting"></a>
# Database connection methonds for SQLite and PostgresDB
---

<a name="connecting-to-localdb"></a>
## Connecting to a Local Database from Terminal
---
A database can be local or remote; it can span a single machine or be distributed with replicated data over several. The latter configuration is called _sharding_.

<a id='sqlite'></a>

### SQLite 
##### - Example of a local DB,  file based - entire DB contained within one file on system

Version 3 of SQLite is bundled with most Python distributions (including our Anaconda distribution). There are two options we recommend for browsing SQLite3 databases:

- [SQLite Browser](http://sqlitebrowser.org/), A free, cross-platform solution.
- [SQLite Manager](https://addons.mozilla.org/en-US/firefox/addon/sqlite-manager/?src), a Firefox add-on for viewing SQLite database files via a simple GUI.

### SQLite Command Line Utility

Connecting to SQLite via the built-in [command line utility](https://www.sqlite.org/sqlite.html)

From terminal command line, type `sqlite3`, followed by the name of the database file.  It will be created if it doesn't already exist.

    $ sqlite3 test1.sqlite

    SQLite version 3.13.0 2016-05-18 10:57:30
    Enter ".help" for usage hints.
    sqlite>

Enter SQLite commands or SQL (terminated by ;) at the sqlite> prompt.  See table below for sqlite commands, .help is the most useful and shows other command possibilities

<a name="remote-database"></a>
## Connecting to a Remote Database from Terminal

---

<a id='postgresql'></a>
### PostgreSQL 
##### - example of server based DB with multiple user access

**[PostgreSQL](http://www.postgresql.org/)** is a powerful SQL-based relational database.

### Connect to command line utility  (GA's PostgreSQL database)

GA provides a PostgreSQL database instance at the following address: 
> `psql -h dsi.c20gkj5cvu3l.us-east-1.rds.amazonaws.com -p 5432 -U dsi_student titanic`  
    Password: gastudents

Enter PosgreSQL commands or SQL (terminated by ;) at the prompt.  The most useful are \q to quit  \? to get PostgreSQL command help, and \h to get SQL command help.

<a id='comparison-commands'></a>
## Comparison of DB Commands 
---
####      - When working in the command line interfaces



|Task|MySQL|PostgreSQL|SQLite|
|---|---|---|---|
|Connect to a database|mysql &lt;dbname&gt;| psql &lt;dbname&gt;|sqlite3 &lt;filename&gt;|
|Client help|help contents|\?|.help|
|SQL help|help contents|\h|n/a|
|List databases|SHOW DATABASES;|\l|.databases|
|Change database|USE &lt;dbname&gt;|\c <dbname&gt;|n/a|
|List tables|SHOW TABLES;|\dt|.tables|
|Show table|info DESCRIBE &lt;tablename&gt;|\d &lt;tablename&gt;|.schema &lt;tablename&gt;|
|Load data|LOAD DATA INFILE &lt;file&gt; |\i &lt;file&gt;|.import &lt;file&gt; &lt;table&gt;|
|Export data|SELECT ... INTO OUTFILE &lt;file&gt;|\o &lt;file&gt;|.dump &lt;table&gt;|
|Exit the client|quit (or exit)| \q|.exit|

<a name="python-sqlite"></a>
## Connecting to Local Database from Python

---

<a id='sqlite3'></a>
### SQLite3

See the Python [SQLAlchemy](https://docs.python.org/2.7/library/sqlite3.html) package for complete documentation

In [ ]:
import sqlite3
sqlite_db = 'test_db.sqlite'    # database will be created if it does not already exist
conn = sqlite3.connect(sqlite_db) 
c = conn.cursor()

_Note: The `.cursor()` method is necessary because, in many DB structures, a cursor is needed to iterate over the rows of data. The cursor also functions as a means of fetching information when using SQLite3. _

The syntax to create a table is similar to the console, only now we use the **`.execute()`** method of the cursor object (`c`) we just created:

### PostgreSQL

See the Python [SQLAlchemy](https://www.sqlalchemy.org/) package for complete documentation

In [ ]:
from sqlalchemy import create_engine

# DSN format for database connections:  [protocol / database  name]://[username]:[password]@[hostname / ip]:[port]/[database name here]
engine = create_engine('postgresql://dsi_student:gastudents@dsi.c20gkj5cvu3l.us-east-1.rds.amazonaws.com:5432/northwind')

<a id='pandas-connector'></a>
    
### Pandas Connector

---

`pandas` provides utilities to quickly placed retrieved data into dataframes to allow for interactive processing.

In [ ]:
import pandas as pd
from pandas.io import sql
import sqlite3

# Connect to Carmen Database
CarmenDB = sqlite3.connect('/Users/erhepp/dsi-nyc-6/database/sql-carmen-sandiego-morning-exercise/Carmen.sqlite')


# Define a function to simplify the queries
def Q(query, db=CarmenDB):
    return sql.read_sql(query, db)

<a id='sql-reference'></a>

# SQL Reference

## Database Creation and Modification Commands
---
### Creating Tables and Adding Columns

Examples are given from sqlite command prompt, but the SQL is the same, whether used at command prompt, or if executed from within a Python program.

Create a table called `table1` with a single column, `field1`, containing an INTEGER PRIMARY KEY.

    sqlite> CREATE TABLE table1 (field1 INTEGER PRIMARY KEY);

Add a few more columns to `table1`.

    sqlite> ALTER TABLE table1 ADD COLUMN field2 VARCHAR(16);
    sqlite> ALTER TABLE table1 ADD COLUMN field3 REAL;
    sqlite> ALTER TABLE table1 ADD COLUMN field4 TEXT;

> Note: _different field types in the ALTER TABLE commands. SQLite supports several different [field types](https://www.sqlite.org/datatype3.html), including INTEGERS, variable length character fields, or VARCHAR (with a max length), TEXT fields, and 'REALS,' which are used to store floating point numbers._

Next, verify that the table was created.

    sqlite> .tables

You can check the schema of the table using `.schema`, which shows the commands that would be necessary to create the database tables from scratch.  

    sqlite> .schema

> Note: _in this case, our `table1` could have been created with a single command rather than by adding each column individually._
    
    sqlite> CREATE TABLE table1 (field1 INTEGER PRIMARY KEY, field2 VARCHAR(16), field3 REAL, field4 TEXT);

<a id='adding-data'></a>
### Adding data

Let's add some data:

    sqlite> INSERT INTO table1 VALUES (1, 'Henry James', 42, '75 Mission Street, San Francisco, CA');
    sqlite> INSERT INTO table1 VALUES (2, 'Carol James', 40, '75 Mission Street, San Francisco, CA');
    sqlite> INSERT INTO table1 VALUES (3, 'Jesse James', 12, '75 Mission Street, San Francisco, CA');

Notice that the first column has unique values â€” this is a requirement for the PRIMARY KEY (PK) column. If we try to add a record using an existing PK value, we'll get an error.

    sqlite> INSERT INTO table1 VALUES (3, 'Julie James', 10, '75 Mission Street, San Francisco, CA');
    Error: UNIQUE constraint failed: table1.field1

Fortunately, SQLite has some built-in functionality to auto-increment the PK value â€” just set the value of the PK field to NULL while running the INSERT command, and it will automatically be set to a valid value.

    sqlite> INSERT INTO table1 VALUES (NULL, 'Julie James', 10, '75 Mission Street, San Francisco, CA');

Now that we have some data, take a look at the database using the **SQLite Browser**.

1. Open the app.
2. Open SQLite3 file "Open Database" from the file menu. 
   - _This file will be most likely be in the directory you were in when we started using `sqlite3` commands._
3. After connecting to the database, click on "Browse Data" in the tabbed UI.

Notice that the value in `field1` for the "Julie James" record has been automatically set to 4.

<a id='updating-records'></a>

### Updating Records

Suppose we need to update an existing record with new data â€” e.g., maybe Julie James is 9. For this, we use the UPDATE command.

    sqlite> UPDATE table1 SET field3=9 WHERE field1=4;

<a id='removing-records'></a>
### Removing Records

To remove records, use the DELETE command.

    sqlite> DELETE FROM table1 WHERE field2 like '%Jesse%';

Use SQLiteManager to verify that the "Jesse James" record has been removed. To exit the SQLite interpreter, type `.exit`.

    sqlite>  .exit

### Creating and updating tables directly from Python
#####     - This section does not use Pandas functionality

In [ ]:
# If table already exists:
c.execute('DROP TABLE houses')
conn.commit()

In [ ]:
c.execute('CREATE TABLE houses (field1 INTEGER PRIMARY KEY, sqft INTEGER, bdrms INTEGER, age INTEGER, price INTEGER);')

# Save (commit) the changes.
conn.commit()

In [ ]:
last_sale = (None, 4000, 5, 22, 619000)
c.execute('INSERT INTO houses VALUES (?,?,?,?,?)', last_sale)

# Remember to commit the changes.
conn.commit()

_Note: use Python's `None` value, rather than `NULL`, to trigger SQLite and auto-increment the Primary Key._

There is a related cursor method, **`.executemany()`**, which takes an array of tuples and loops through them, substituting one tuple at a time.

In [ ]:
recent_sales = [
  (None, 2390, 4, 34, 319000),
  (None, 1870, 3, 14, 289000),
  (None, 1505, 3, 90, 269000),
]

c.executemany('INSERT INTO houses VALUES (?, ?, ?, ?, ?)', recent_sales)

conn.commit()

<a id='adding-csv'></a>
### Adding Data From a .csv File
##### - Without Pandas

Next, let's load our `housing.csv` data into an array and then `INSERT` those records into the database. In this example, we'll use the `numpy` `.genfromtxt()` function to read the file and parse its contents.

In [ ]:
from numpy import genfromtxt

# import into nparray of ints, then convert to list of lists
data = (genfromtxt('housing-data_Iura.csv', dtype='i8', 
                    delimiter=',', skip_header=1)).tolist()

# append a None value to beginning of each sub-list
for d in data:
    d.insert(0, None)

In [ ]:
data[0:3]

In [ ]:
# Loop through data, running an INSERT on each record (i.e., sublist).
for d in data:
    c.execute('INSERT INTO houses VALUES (?, ?, ?, ?, ?)', d)

conn.commit()

> **Remember:** All elements in a `numpy` array must be the same data type, so, if we want to "add a `None`" to each row, we would need to work around this. Lists can contain mixed types, so this is one approach.

Still, in this case, the value we're adding is the same for all records, so we can simply use a `None` in the INSERT statement.

### Retrieving data to a list, not a dataframe

In [ ]:
# Similar syntax as before.
results = c.execute("SELECT * FROM houses WHERE bdrms = 4")

# Here, results is a cursor object â€” use `.fetchall()` to extract a list.
results.fetchall()

#### Adding data from a .csv file 
##### - With Pandas

In [ ]:
# Read a csv file directly into a dataframe

data = pd.read_csv('housing-data.csv')  
data.head()

### Writing data back to a DB
##### - With Pandas

Data is moved to the database through the `to_sql` command, similar to the `to_csv` command.

`to_sql` takes the following arguments:
- `name`, the table name to create.
- `con`, a connection to a database.
- `index`, whether or not to input the index column.
- `schema`, if we want to write a custom schema for the new table.
- `if_exists`, what to do if the table already exists. We can overwrite it, add to it, or fail.

In [ ]:
# Move data from a dataframe into a table in a DB

data.to_sql('houses_pandas',             # Name of the table.
            con=conn,                    # The handle to the file that is set up.
            if_exists='replace',         # Overwrite, append, or fail.
            index=False)                 # Add index as column.

<a id='SQL-command-order'></a>

## Database Search and Retrieval Commands

### Constructing Select command in correct order

This information on command order is taken directly from https://docs.microsoft.com/en-us/sql/t-sql/queries/select-transact-sql  It was modified to add imformation on JOIN, LIMIT and LIKE.


Retrieves rows from the database and enables the selection of one or many rows or columns from one or many tables in SQL Server. The full syntax of the SELECT statement is complex, but the main clauses can be summarized as:

[ WITH { [ XMLNAMESPACES ,] [ ] } ]

[ SELECT select_list ] [ INTO new_table ] 

[ FROM table_source ]  [ INNER | OUTER | LEFT  JOIN table_source ]

[ WHERE search_condition ] [ LIKE pattern ]

[ GROUP BY group_by_expression ]

[ HAVING search_condition ]

[ ORDER BY order_expression [ ASC | DESC ] 

[ LIMIT number_rows_to_return ]

The UNION, EXCEPT, and INTERSECT operators can be used between queries to combine or compare their results into one result set.

##### Notes:
 - table_source can be a nested select query, see section below on sub-queries
 - select_list can include aggregation operators like AVG COUNT ....
 - JOIN assumes INNER unless OUTER OR LEFT are specified.

### Select Command Directives

> Note: Each of the following can be demonstrated in `pandas` using the data we've set up above. A demo and check are included for each, but we can try out a few before we begin.

### SELECT

Every query should start with `SELECT`. `SELECT` is followed by the names of the columns in the output.

`SELECT *` returns *all* of the columns.

### FROM

`SELECT` is always paired with `FROM`, which identifies the table from which we're retrieving the data.


### WHERE

`WHERE`, which follows the `FROM` clause, is used to filter tables using specific criteria.

The condition is a filter that's applied to the rows. The rows that match the condition will be included in the output.

### LIKE

The `LIKE` operator is used in a `WHERE` clause to search for a specific pattern within a column.
> **Tip**: The `"%"` sign is used to define wildcards (missing letters) both before and after the pattern. Also, notice that PostgreSQL is case sensitive.

<a name="aggregations"></a>

#### Aggregations 
- These modify the columns in the select statement
- At least one must be specifed when using GROUP BY

Aggregations (or aggregate functions) are functions in which the values of multiple rows are grouped together as an input on certain criteria to form a single value of more significant meaning or measurement. Examples are sets, bags, or lists.

Aggregate funtions include:

- Average (i.e., arithmetic mean)
- Count
- Maximum
- Minimum
- Median
- Mode
- Sum

In SQL, they are performed in a `SELECT` statement.

In [2]:
# Let's use the Carmen Sandiego Database for some examples.
# Using the SQLite version here, so it's easily available for off-line experimentation

# Use pandas sql module
import pandas as pd
from pandas.io import sql
import sqlite3

# Connect to Carmen Database
CarmenDB = sqlite3.connect('/Users/erhepp/dsi-nyc-6/database/sql-carmen-sandiego-morning-exercise/Carmen.sqlite')


# Define a function to simplify the queries
def Q(query, db=CarmenDB):
    return sql.read_sql(query, db)

In [3]:
# Example - return all columns from a table.  Limit the output to the first 3 rows

Q('SELECT * FROM city LIMIT 3')

   id      name countrycode  district  population
0   1     Kabul         AFG     Kabol     1780000
1   2  Qandahar         AFG  Qandahar      237500
2   3     Herat         AFG     Herat      186800

In [5]:
# Example - return only rows where population is greater than 1 million. 

Q('SELECT * FROM city WHERE population > 1000000 LIMIT 3')

   id    name countrycode district  population
0   1   Kabul         AFG    Kabol     1780000
1  35   Alger         DZA    Alger     2168000
2  56  Luanda         AGO   Luanda     2022000

In [6]:
# Example - Show cities in districts where the district name begins with K. Limit to 3 rows
Q('SELECT * FROM city WHERE "district" LIKE "K%" LIMIT 3')

    id     name countrycode district  population
0    1    Kabul         AFG    Kabol     1780000
1  152   Khulna         BGD   Khulna      663340
2  159  Jessore         BGD   Khulna      139710

In [7]:
# Example - count the cities that have a population over 1 million.  
# The AS operator was used to make the label more readable, it is documented later in this review document

Q('SELECT COUNT("name") AS "Number of Cities over 1 million" FROM city WHERE population > 1000000;')

   Number of Cities over 1 million
0                              237

## SQL JOIN Types

---

SQL JOINs are used when data is spread out in different tables. A JOIN operation allows us to combine rows from two or more tables in a single new table. In order for this to be possible, a common field need to exists between the tables.

JOIN operations can be considered operations between two sets in which records with the same key are combined and records missing in one set are either discarded or included as NULL values.

![join types](../images/joins.gif)

JOIN types include:
- **INNER JOIN:** Returns all rows where there is at least one match in BOTH tables.
- **LEFT JOIN:** Returns all rows from the left table and matched rows from the right table.
- **RIGHT JOIN:** Returns all rows from the right table and matched rows from the left table.
- **FULL JOIN:** Returns all rows where there is a match in ONE of the tables.

In [31]:
Q('''SELECT country."name" AS 'country name', city."district", city."name" AS 'city name'
        FROM country INNER JOIN city ON country."code" = city."countrycode"
        WHERE country."continent" = 'Asia'
        LIMIT 3;
''')

  country name district       city name
0  Afghanistan    Herat           Herat
1  Afghanistan    Kabol           Kabul
2  Afghanistan    Balkh  Mazar-e-Sharif

<a id='order-by'></a>

## `ORDER BY`

---

The `ORDER BY` keyword is used to sort a result set by one or more columns. It sorts records in ascending order by default. To sort the records in descending order, you can use the `DESC` keyword.

### SQL `ORDER BY` Syntax

```*.sql
SELECT column_name1, column_name2  
FROM table_name  
ORDER BY column_name1 ASC, column_name2 DESC;
```

<a id='alias-as'></a>
## Alias `AS`

---

SQL aliases are used to give a database table â€” or a column in a table â€” a temporary name. Aliases are often created for two purposes:
1. To make output column names more readable (substitute names). 
2. To make queries more concise (shorten query arguments).

### SQL Alias Syntax for Columns

```*.sql
SELECT column_name AS alias_name  
FROM table_name;
```

### SQL Alias Syntax for Tables

```*.sql
SELECT column_name(s)  
FROM table_name AS alias_name;
```

<a id='like-operator'></a>
## SQL's `LIKE` Operator

---

The `LIKE` operator is used in a `WHERE` clause to search for a specific pattern within a column.


### SQL `LIKE` Syntax

```*.sql

SELECT column_name(s) 
FROM table_name  
WHERE column_name LIKE pattern;

```

> **Tip**: The `"%"` sign is used to define wildcards (missing letters) both before and after the pattern. Also, notice that PostgreSQL is case sensitive.

<a id='SQL-sub-queries'></a>
## SQL Sub-queries

Subqueries, also called inner or nested queries, is used to return data that will be used by the main query.

They are primarily useful in two situations:
- Return information based on comparison with some aggregating statistic, like all values greater than a mean.
- Return information from a table, restricted to some condition on another table, but when you don't want any of the information from the second table.
 

An excellent reference for subqueries can be found at the Tutorials Point - Learn SQL website: https://www.tutorialspoint.com/sql/sql-sub-queries.htm

**Basic rules:**   (This information from Tutorials Point.)
- Subqueries must be enclosed within parentheses.
- A subquery can have only one column in the SELECT clause, unless multiple columns are in the main query for the subquery to compare its selected columns.
- An ORDER BY command cannot be used in a subquery, although the main query can use an ORDER BY. The GROUP BY command can be used to perform the same function as the ORDER BY in a subquery.
- Subqueries that return more than one row can only be used with multiple value operators such as the IN operator.
- The SELECT list cannot include any references to values that evaluate to a BLOB, ARRAY, CLOB, or NCLOB.
- A subquery cannot be immediately enclosed in a set function.
- The BETWEEN operator cannot be used with a subquery. However, the BETWEEN operator can be used within the subquery.

In [15]:
Q('''SELECT city."district", city."name" AS 'city name'
        FROM city 
        WHERE "countrycode" IN
            (SELECT "code"
                FROM country 
                WHERE "region" = "Western Europe"
            )
        LIMIT 5;
''')

        district  city name
0  Noord-Holland  Amsterdam
1   Zuid-Holland  Rotterdam
2   Zuid-Holland       Haag
3        Utrecht    Utrecht
4  Noord-Brabant  Eindhoven

In [32]:
Q('''SELECT "name" AS "Country Name", "lifeexpectancy"
        FROM country
        WHERE "lifeexpectancy" >
            (SELECT AVG("lifeexpectancy")
                FROM country
            )
        ORDER BY "lifeexpectancy" DESC    
        LIMIT 5;
''')

  Country Name  lifeexpectancy
0      Andorra            83.5
1        Macao            81.6
2   San Marino            81.1
3        Japan            80.7
4    Singapore            80.1